#!/usr/bin/ruby
# ----------------------------------------------------------------------------
require 'output'
# ----------------------------------------------------------------------------
Output.start
Output.header 'Редактирование истории доступа'
# ----------------------------------------------------------------------------
Output.text "ПОКА НЕТ"
Output.text Output.link_to('index.cgi','Вернуться к началу')
Output.finish
# ----------------------------------------------------------------------------

